In [1]:
import pandas as pd
import numpy as np
import datetime
from datetime import datetime, timedelta

## Load __df_market__ to make dataset to prediction

In [2]:
df_market = pd.read_csv('../data/df_market.csv')

In [3]:
print(df_market.shape)
df_market.head(1)

(45986376, 7)

,date,id,store,sales,sell_price,event,income
0,2011-01-29,ACCESORIES_1_008_NYC_1,Greenwich_Village,12,0.6118,no event,7.3416

In [4]:
df_market.set_index('date', inplace=True)

### Need __item__ , I obtain of __id__

In [5]:
df_market['item']=df_market['id'].apply(lambda x: x[:-6])
df_market.head(1)

,id,store,sales,sell_price,event,income,item
date,,,,,,,
2011-01-29,ACCESORIES_1_008_NYC_1,Greenwich_Village,12,0.6118,no event,7.3416,ACCESORIES_1_008

### After analize, I work with top 100 in **income**

In [6]:
top100= df_market.groupby( ["item"])["income"].sum().sort_values(ascending=False).head(100).reset_index()

In [7]:
list_top100 = list(top100['item'].unique())

### Filter my top_100 list for work with them

In [8]:
df_top100 = df_market[df_market['item'].isin(list_top100)]

In [9]:
df_top100.head()

,id,store,sales,sell_price,event,income,item
date,,,,,,,
2011-01-29,ACCESORIES_1_108_NYC_1,Greenwich_Village,4,16.1196,no event,64.4784,ACCESORIES_1_108
2011-01-29,HOME_&_GARDEN_1_027_NYC_1,Greenwich_Village,4,6.5500,no event,26.2000,HOME_&_GARDEN_1_027
2011-01-29,HOME_&_GARDEN_1_053_NYC_1,Greenwich_Village,0,18.7125,no event,0.0000,HOME_&_GARDEN_1_053
2011-01-29,HOME_&_GARDEN_1_140_NYC_1,Greenwich_Village,4,18.7500,no event,75.0000,HOME_&_GARDEN_1_140
2011-01-29,HOME_&_GARDEN_1_177_NYC_1,Greenwich_Village,0,9.9625,no event,0.0000,HOME_&_GARDEN_1_177

In [10]:
df_top100 = df_top100[['id','item','sales','income','event']]

In [11]:
df_top100.head(1)

                                id              item  sales   income     event
date
2011-01-29  ACCESORIES_1_108_NYC_1  ACCESORIES_1_108      4  64.4784  no event

### Prepared dataset with numeric values

In [12]:
df_top100['event'] = np.where(df_top100['event']=="no event",0,1)
df_top100.head(2)

,id,item,sales,income,event
date,,,,,
2011-01-29,ACCESORIES_1_108_NYC_1,ACCESORIES_1_108,4,64.4784,0
2011-01-29,HOME_&_GARDEN_1_027_NYC_1,HOME_&_GARDEN_1_027,4,26.2000,0

In [13]:
file_name = "ts_top100_prediction.csv" 
df_top100.to_csv(file_name)